<template>
  <div><Store :store="store" is-active="true" /></div>
</template>

<script setup>
import Store from "@/components/sections/Store.vue";
const store = [
  {
    title: "Опыт работы",
    list: [
      {
        place: "AX Technology",
        whom: "Разработчик",
        date: "Январь 2023 - по настоящее время",
        sert: "Фронтенд",
        desc: "Разработка и оптимизация веб-сайтов с анимациями.",
        responsibilities: {
          title: "Обязанности",
          desc: [
            "- Разработка адаптивных и кроссбраузерных веб-интерфейсов",
            "- Реализация анимаций с использованием GSAP, ScrollTrigger и других библиотек",
            "- Интеграция 3D и VR-элементов в сайты (включая работу с Oculus и Vision Pro)",
            "- Оптимизация производительности и скорости загрузки страниц",
            "- Работа с HTML, CSS (SCSS), JavaScript",
            "- Ведение проектов от макета до финальной публикации",
            "- Контроль выполнения задач командой разработчиков",
            "- Проведение технических собеседований с кандидатами",
            "- Организация и распределение служебного такси для сотрудников",
            "- Проведение внутренних курсов и тренингов по анимациям и интерактиву",
          ],
        },
      },
    ],
  },
];
</script>

<style lang="scss" scoped></style>
